Autodesk.Revit.DB.SpacingRuleLayout
Rules for laying out a series of equidistant points or parallel lines

Autodesk.Revit.DB.SpacingRuleLayout.MinimumSpacing
Points or lines are separated by at least the minimum distance.

Autodesk.Revit.DB.SpacingRuleLayout.MaximumSpacing
Points or lines are separated by at most the max distance.

Autodesk.Revit.DB.SpacingRuleLayout.FixedNumber
Fixed number of points or lines with uniform distance between them.

Autodesk.Revit.DB.SpacingRuleLayout.FixedDistance
Points or lines are separated by a fixed distance.

Autodesk.Revit.DB.SpacingRuleLayout.None
No points or lines will be created.